# Core CLI tools
brew "fzf"
brew "bat"
brew "eza"
brew "ripgrep"
brew "zoxide"
brew "tldr"
brew "git-delta"
brew "lazygit"
brew "atuin"
brew "gh"
brew "tmux"
brew "jujutsu" 

brew "starship"     # prompt
brew "direnv"       # auto env loading
brew "mise"         # runtime manager

